#include <stdio.h>

int main()
{
    int amount;                              // ประกาศตัวแปรสำหรับเก็บจำนวนเงิน
    int b1000, b500, b100, b50, b20;         // ตัวแปรสำหรับเก็บจำนวนธนบัตรแต่ละประเภท
    int min_amout = 20, max_amount = 100000; // กำหนดขีดจำกัดของจำนวนเงินต่ำสุดกับมากสุด

    // แสดงข้อความต้อนรับ
    printf("ATM Calculator\n");
    printf("โปรแกรมคำนวณจำนวนธนบัตรที่ต้องการถอน\n");
    printf("---------------------------------------\n");

    printf("กรุณาใส่จำนวนเงินที่ต้องการถอน: "); // ขอให้ผู้ใช้ป้อนจำนวนเงิน
    scanf("%d", &amount);                 // รับค่าจำนวนเงิน

    // ตรวจสอบว่าจำนวนเงินที่ผู้ใช้ป้อนมาอยู่ในช่วงที่กำหนดมั้ยถ้าไม่จะมีข้อความแจ้งเตือนและหยุดทำงาน
    if (amount < min_amout || amount > max_amount)
    {
        printf("จำนวนเงินต้องอยู่ระหว่าง %d ถึง %d บาท\n", min_amout, max_amount); // แจ้งเตือนหากจำนวนเงินไม่อยู่ในช่วงที่กำหนด
        return 0;                                                            // หยุดการทำงานของโปรแกรม
    }

    // คำนวณจำนวนธนบัตรที่ต้องการ
    b1000 = amount / 1000; // นำเงินที่ถอนหารด้วย 1000 เพื่อหาจำนวนธนบัตร 1000 บาท
    amount %= 1000;        // นำ amount มาหาร 1000 อีกครั้งและเก็บในตัวแปร amount เพื่อหาจำนวนเงินเหลือจากการหาแบงค์ 1000 บาท
    b500 = amount / 500;   // นำเงินที่เหลือหารด้วย 500 เพื่อหาจำนวนธนบัตร 500 บาท
    amount %= 500;         // นำ amount มาหาร 500 อีกครั้งและเก็บในตัวแปร amount เพื่อหาจำนวนเงินเหลือจากการหาแบงค์ 500 บาท
    b100 = amount / 100;   // นำเงินที่เหลือหารด้วย 100 เพื่อหาจำนวนธนบัตร 100 บาท
    amount %= 100;         // นำ amount มาหาร 100 อีกครั้งและเก็บในตัวแปร amount เพื่อหาจำนวนเงินเหลือจากการหาแบงค์ 100 บาท
    b50 = amount / 50;     // นำเงินที่เหลือหารด้วย 50 เพื่อหาจำนวนธนบัตร 50 บาท
    amount %= 50;          // นำ amount มาหาร 50 อีกครั้งและเก็บในตัวแปร amount เพื่อหาจำนวนเงินเหลือจากการหาแบงค์ 50 บาท
    b20 = amount / 20;     // นำเงินที่เหลือหารด้วย 20 เพื่อหาจำนวนธนบัตร 20 บาท
    amount %= 20;          // นำ amount มาหาร 20 อีกครั้งและเก็บในตัวแปร amount เพื่อหาจำนวนเงินเหลือจากการหาแบงค์ 20 บาท

    // แสดงผลจำนวนธนบัตรที่ได้
    printf("\nจำนวนธนบัตรที่ได้:\n");
    printf("---------------------------------------\n");
    printf("| ธนบัตร 1,000 บาท  จำนวน %3d ใบ   |\n", b1000);
    printf("| ธนบัตร   500 บาท  จำนวน %3d ใบ   |\n", b500);
    printf("| ธนบัตร   100 บาท  จำนวน %3d ใบ   |\n", b100);
    printf("| ธนบัตร    50 บาท  จำนวน %3d ใบ   |\n", b50);
    printf("| ธนบัตร    20 บาท  จำนวน %3d ใบ   |\n", b20);
    printf("---------------------------------------\n");
    // ทำการดักจับกรณีหารไม่ลงตัวหรือมีเศษเงินเหลืออยู่ ก็คือ amount มากกว่า 0 จะแสดงข้อความแจ้งเตือนว่ามีเงินทอนที่ไม่สามารถถอนได้
    if (amount > 0)
    {
        printf("มีเงินทอนที่ไม่สามารถถอนได้: %d บาท\n", amount);
    }

    return 0;
}
