#include <stdio.h>

int main()
{
    int numbers[5]; // สร้าง array เปล่า เก็บตัวเลข 5 ตัวหรือ 5ช่อง เริ่มจาก 0 แทนการสร้าง num1 num2.. เพื่อให้เร็ว
    int max, min;   // ตัวแปรสำหรับเก็บค่ามากสุดและน้อยสุด

    // Loop เพื่อรับค่าตัวเลข 5 ตัวจากผู้ใช้
    printf("กรุณาใส่ตัวเลข 5 ตัว:\n");
    for (int i = 0; i < 5; i++)
    {
        printf("กรุณาใส่ตัวเลขที่ %d: ", i + 1); // ขอให้ผู้ใช้ป้อนค่าตัวเลข
        scanf("%d", &numbers[i]);           // รับค่าตัวเลขจากผู้ใช้และเก็บใน array
    }

    // กำหนดให้ max และ min มีค่าเท่ากับ array index ช่องที่ 0
    max = min = numbers[0]; 

    // วนลูปเพื่อหาค่ามากสุดและน้อยสุด โดยเริ่มจาก1 ไม่ใช่ 0 เพื่อเปรียบเทียบ
    for (int i = 1; i < 5; i++)
    {
        if (numbers[i] > max) //ตรวจสอบค่าที่ loop ตั้งแต่ 1 มากกว่า max ที่เท่ากับ numbers ช่องที่ 0มั้ย
        {
            max = numbers[i];//ถ้าใช่ ให้เปลี่ยนค่า max เป็นค่าที่มากกว่า
        }
        if (numbers[i] < min) //ตรวจสอบค่าที่ loop ตั้งแต่ 1 น้อยกว่า min ที่เท่ากับ numbers ช่องที่ 0มั้ย
        {
            min = numbers[i]; //ถ้าใช่ ให้เปลี่ยนค่า min เป็นค่าที่น้อยกว่า
        }
    }

    // แสดงผลลัพธ์ตัวเลขที่ป้อนเข้ามา
    printf("\nค่าที่รับเข้ามา: ");
    for (int i = 0; i < 5; i++)
    {
        printf("%d ", numbers[i]);
    }
    // แสดงเลขต่ำสุดและมากสุด
    printf("\nค่ามากที่สุดคือ: %d\n", max);
    printf("ค่าน้อยที่สุดคือ: %d\n", min);

    return 0;
}