#include <stdio.h>

int main()
{
    int years, months, total_days; // ประกาศตัวแปรสำหรับปี เดือน และจำนวนวันทั้งหมด เป็นจำนวนเต็ม

    printf("กรุณาใส่จำนวนปี: "); // ขอให้ผู้ใช้ป้อนจำนวนปี
    scanf("%d", &years);      // รับค่าจำนวนปีจากผู้ใช้

    printf("กรุณาใส่จำนวนเดือน: "); // ขอให้ผู้ใช้ป้อนจำนวนเดือน
    scanf("%d", &months);        // รับค่าจำนวนเดือนจากผู้ใช้

    // ประมาณคร่าวว่า 1 ปี = 365 วัน, 1 เดือน = 30 วัน
    total_days = (years * 365) + (months * 30); // นำจำนวนปีมาคูณด้วย 365 และจำนวนเดือนมาคูณด้วย 30 แล้วบวกผลลัพธ์เข้าด้วยกัน

    printf("จำนวนวันทั้งหมดคือ: %d วัน\n", total_days); // แล้วแสดงผลลัพธ์จำนวนวันทั้งหมดที่ได้จาก variable total_days

    return 0; // จบการทำงานของโปรแกรม
}
